K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
/*
 *   IC905_ESP32-S3_PTT_Breakout.cpp
 *   Jan 2025 by K7MDL
 *
 *  This program is a USB Host Serial device that reads the Icom IC-905 USB CI_V frequency messages.
 *  For 10GHz and higher the IC-905 adds 1 extra byte thqat must be accounted for to decode the BCD encoded frequency
 *  The last data byte sent for frequency is the MSB.
 *  The radio PTT (aka SEND output) is wired into this CPU and monitored.
 *  There are 6 PTT and 6 band enable outputs, with status LEDs for each
 *  PTT is normally +5V if directly connected to the SEND jack with a weak pullup at the radio and/or at the CPU
 *  When PPT = 0 (radio is in TX) then we use the last frequency seen and send 1 to the matching band's PTT output.
 *  A ULN2803A open collector octal driver buffers the CPU outputs and also inverts so a logic 1 results in closure to GND.
 * 
 *  Support for the AtomS3 is enabled by a #define ATOMS3. It has no I/O but has a nice small color LCD that displays
 *  frequency, time/date from radio, BAND, TX status, location which I caclulate 8 digit grid sqaure from.  
 *  On bootup the radio is polled for time, location, band/frequency, modem, extended mode.  
 *  After that it listens for messages only so it does not interfere with future PC to Radio CI_V serial bridging.
 * 
 *  ---------------------------------------------------------------------------------
 * The USB Serial Host part of this program is based on cdc_acm_host example file from 
 * 
 * SPDX-FileCopyrightText: 2015-2023 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: CC0-1.0
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <inttypes.h>
#include "esp_system.h"
#include "esp_log.h"
#include "esp_err.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "freertos/queue.h"
#include "freertos/event_groups.h"
#include "driver/gpio.h"
#include "driver/gpio_filter.h"
#include "esp_timer.h"
#include "usb/usb_host.h"
#include "usb/cdc_acm_host.h"
#include "time.h"
#include <sys/time.h>
#include "driver/ledc.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"

//#define ATOMS3

#include "IC905_ESP32-S3_PTT_Breakout.h"
#include "Decoder.h"
#include "CIV.h"
#include "LED_Control.h"

//#define USB_PC

#ifdef USB_PC
    #include "tusb_cdc_acm.h"
    #include "tinyusb.h"
    #include "sdkconfig.h"
    //#define CONFIG_TINYUSB_CDC_RX_BUFSIZE 512
    static uint8_t rx_buf[CONFIG_TINYUSB_CDC_RX_BUFSIZE + 1];
#endif

// Our own functions
void display_Freq(uint64_t _freq, bool _force);
void display_Time(uint8_t _UTC, bool _force);
void display_PTT(bool _PTT_state, bool _force);
void display_Band(uint8_t _band, bool _force);
void display_Grid(char _grid[], bool _force);
void SetFreq(uint64_t Freq);
void poll_for_time(void);

struct Bands bands[NUM_OF_BANDS] = {
  { "DUMMY", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0xFF },                                       // DUMMY Band to avoid using 0
  { "2M", 144000000, 148000000, 0, 144200000, 1, 1, 0, 1, 0, 0, 0, DECODE_INPUT_BAND144 },                  // 2m
  { "70cm", 430000000, 450000000, 0, 432100000, 1, 1, 0, 1, 0, 0, 0, DECODE_INPUT_BAND430 },                // 430/440  No LO
  { "23cm", 1240000000, 1300000000, 0, 1296100000, 1, 1, 0, 1, 0, 0, 0, DECODE_INPUT_BAND1200 },            // 1296Mhz  with 144Mhz LO
  { "13cm", 2300000000, 2450000000, 0, 2304100000, 1, 1, 0, 1, 0, 0, 0, DECODE_INPUT_BAND2300 },            // 2.3 and 2.4GHz
  { "6cm",  5650000000, 5925000000, 0, 5760100000, 1, 1, 0, 1, 0, 0, 0, DECODE_INPUT_BAND5600 },            // 5.7GHz
  { "3cm", 10000000000, 10500000000, 0, 10368100000, 1, 1, 0, 1, 0, 0, 0, DECODE_INPUT_BAND10G },           // 10GHz
};

char title[25] = "IC-905 Band Decoder";
uint16_t baud_rate;                   //Current baud speed
uint32_t readtimeout = 10;            //Serial port read timeout
uint8_t band = BAND_2M;
#ifdef ATOMS3
    uint16_t background_color = TFT_BLACK;
#endif
bool PTT = false;
bool prev_PTT = true;
extern char Grid_Square[];
extern struct Modes_List modeList[];
//extern char FilStr;
extern struct cmdList cmd_List[];
uint8_t radio_address = RADIO_ADDR;  //Transceiver address.  0 allows auto-detect on first messages form radio
bool use_wired_PTT = WIRED_PTT;           // Selects source of PTT, wired input or polled state from radio.  Wired is preferred, faster.
uint8_t read_buffer[64];  //Read buffer
uint8_t prev_band = 0x0;
uint64_t prev_frequency = 0;
uint16_t poll_radio_ptt = POLL_PTT_DEFAULT;  // can be changed with detected radio address.
uint8_t UTC = 1;  // 0 local time, 1 UTC time
bool update_radio_settings_flag = false;
extern bool BtnA_pressed;
extern bool BtnB_pressed;
extern bool BtnC_pressed;
uint8_t readLine(void);
void processCatMessages(const uint8_t *pData, size_t data_len);
void sendCatRequest(const uint8_t cmd_num, const uint8_t Data[], const uint8_t Data_len);  // first byte in Data is length
void printFrequency(void);
void read_Frequency(uint64_t freq, uint8_t data_len);
uint8_t getBand(uint64_t _freq);
void refresh_display(void);
void draw_new_screen(void);
void read_Frequency(uint64_t freq, uint8_t data_len);
uint8_t formatFreq(uint64_t vfo, uint8_t vfo_dec[]);
extern void CIV_Action(const uint8_t cmd_num, const uint8_t data_start_idx, const uint8_t data_len, const uint8_t msg_len, const uint8_t *rd_buffer);
uint8_t pass_PC_to_radio(void);
extern uint8_t USBHost_ready;  // 0 = not mounted.  1 = mounted, 2 = system not initialized
bool USBH_connected = false;
extern uint16_t background_color;
uint64_t frequency;
extern bool update_radio_settings_flag;
static const char *TAG = "USB-CDC";
static SemaphoreHandle_t device_disconnected_sem;
uint8_t *r = read_buffer;
bool msg_done_flag;
bool get_ext_mode_flag = false;
cdc_acm_dev_hdl_t cdc_dev = NULL;
uint8_t board_type = 0;
bool BLE_connected = 0;
bool btConnected = 0;
uint8_t brightness = 110;   // 0-255
uint8_t rotation   = 3;   // 0-3
struct tm tm;
time_t t;
bool init_done = 0;
bool sending = 0;
static int adc_raw[1][10];
static int voltage[1][10];
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle);
static void adc_calibration_deinit(adc_cali_handle_t handle);
uint8_t radio_address_received = 0;

// ADC setup
adc_cali_handle_t adc2_cali_chan0_handle = NULL;
bool do_calibration2 = adc_calibration_init(ADC_UNIT_2, ADC2_CHAN0, ADC_ATTEN, &adc2_cali_chan0_handle);

adc_oneshot_unit_handle_t adc2_handle;
adc_oneshot_unit_init_cfg_t init_config2 = {
    .unit_id = ADC_UNIT_2,
    .ulp_mode = ADC_ULP_MODE_DISABLE,
};

uint32_t led_bright_level = LED_BRIGHT_LEVEL;   // New level to set LEDs to

// Mask all 12 of our Band and PTT output pins for Output mode, also our 8 LED output pins
#define GPIO_OUTPUT_PIN_SEL  (1ULL<<GPIO_BAND_OUTPUT_144  | 1ULL<<GPIO_BAND_OUTPUT_430  | 1ULL<<GPIO_BAND_OUTPUT_1200 \
                            | 1ULL<<GPIO_BAND_OUTPUT_2300 | 1ULL<<GPIO_BAND_OUTPUT_5600 | 1ULL<<GPIO_BAND_OUTPUT_10G  \
                            | 1ULL<<GPIO_PTT_OUTPUT_144   | 1ULL<<GPIO_PTT_OUTPUT_430   | 1ULL<<GPIO_PTT_OUTPUT_1200  \
                            | 1ULL<<GPIO_PTT_OUTPUT_2300  | 1ULL<<GPIO_PTT_OUTPUT_5600  | 1ULL<<GPIO_PTT_OUTPUT_10G   \
                            | 1ULL<<LEDC_OUTPUT_144_IO    | 1ULL<<LEDC_OUTPUT_430_IO    | 1ULL<<LEDC_OUTPUT_1200_IO   \
                            | 1ULL<<LEDC_OUTPUT_2300_IO   | 1ULL<<LEDC_OUTPUT_5600_IO   | 1ULL<<LEDC_OUTPUT_10G_IO    \
                            | 1ULL<<LEDC_OUTPUT_PWR_ON_IO | 1ULL<<LEDC_PTT_IN_OUTPUT_IO);

// Mask our 1 PTT input IO pin for Input with pull up. An interrupt wil be assigned to this pin.
#define GPIO_INPUT_PIN_SEL  (1ULL<<GPIO_PTT_INPUT)
#define ESP_INTR_FLAG_DEFAULT 0

static QueueHandle_t gpio_evt_queue = NULL;

/**
 * Brief:
 * This GPIO code configures gpio outputs fro band and PTT and the gpio input interrupt on the PTT input
 *
 * GPIO status:
 * GPIO5 : output
 * GPIO6 : output
 * GPIO7 : output
 * GPIO10 : output
 * GPIO11 : output
 * GPIO12 : output
 * GPIO1:  input, pulled up, interrupt from rising edge and falling edge
 *
 * add 6 More for PTT pins
 * 
 * Test:
 * Monitor voltage at pins
 *
 */
static void IRAM_ATTR gpio_isr_handler(void* arg)
{
    uint32_t gpio_num = (uint32_t) arg;
    xQueueSendFromISR(gpio_evt_queue, &gpio_num, NULL);
}

