K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
// display PTT Input status to screen
// Set PTT Flag and service it in the main loop. 
static void gpio_PTT_Input(void* arg)
{
    uint32_t io_num;
    for(;;) {
        if(xQueueReceive(gpio_evt_queue, &io_num, portMAX_DELAY)) {
            PTT = (uint8_t) gpio_get_level((gpio_num_t) io_num);  // Invert for buffer
            ESP_LOGI(TAG,"GPIO[%lu] intr, val: %d", io_num, PTT);
            PTT_Output(band, PTT);
            display_PTT(PTT, false);
            
            #ifdef USE_LEDS  // toggle PTT LED
                if (PTT) {
                    ESP_ERROR_CHECK(ledc_set_duty(LEDC_MODE, LEDC_PTT_IN_OUTPUT_CH, led_bright_level));
                    //ESP_ERROR_CHECK(ledc_timer_resume(LEDC_MODE, LED_TIMER_PTT));
                } else {
                    ESP_ERROR_CHECK(ledc_set_duty(LEDC_MODE, LEDC_PTT_IN_OUTPUT_CH, LEDC_OFF_DUTY));
                    //ESP_ERROR_CHECK(ledc_timer_pause(LEDC_MODE, LED_TIMER_PTT));
                }
                // Update duty to apply the new value
                ESP_ERROR_CHECK(ledc_update_duty(LEDC_MODE, LEDC_PTT_IN_OUTPUT_CH));
            #else
                // 100% ON or OFF.  This is too bright so use PWM method preferred
                gpio_set_level(GPIO_NUM_48, !PTT);   // Pin is Open Drain, set to 0 to close to GND and turn on LED.
                refresh_display();
            #endif
        }
    }
}

#ifdef USB_PC
    /**
     * @brief Application Queue
     */
    static QueueHandle_t app_queue;
    typedef struct {
        uint8_t buf[CONFIG_TINYUSB_CDC_RX_BUFSIZE + 1];     // Data buffer
        size_t buf_len;                                     // Number of bytes received
        uint8_t itf;                                        // Index of CDC device interface
    } app_message_t;

    app_message_t msg;

    /**
     * @brief CDC device RX callback
     *
     * CDC device signals, that new data were received
     *
     * @param[in] itf   CDC device index
     * @param[in] event CDC event type
     */
    void tinyusb_cdc_rx_callback(int itf, cdcacm_event_t *event)
    {
        /* initialization */
        size_t rx_size = 0;

        /* read */
        esp_err_t ret = tinyusb_cdcacm_read(itf, rx_buf, CONFIG_TINYUSB_CDC_RX_BUFSIZE, &rx_size);
        if (ret == ESP_OK) {

            app_message_t tx_msg = {
                .buf_len = rx_size,
                .itf = itf,
            };

            memcpy(tx_msg.buf, rx_buf, rx_size);
            xQueueSend(app_queue, &tx_msg, 0);
        } else {
            ESP_LOGE(TAG, "Read Error");
        }
    }

    /**
     * @brief CDC device line change callback
     *
     * CDC device signals, that the DTR, RTS states changed
     *
     * @param[in] itf   CDC device index
     * @param[in] event CDC event type
     */
    void tinyusb_cdc_line_state_changed_callback(int itf, cdcacm_event_t *event)
    {
        int dtr = event->line_state_changed_data.dtr;
        int rts = event->line_state_changed_data.rts;
        ESP_LOGI(TAG, "Line state changed on channel %d: DTR:%d, RTS:%d", itf, dtr, rts);
    }
#endif // USB_PC


/**
 * @brief Data received callback
 *
 * @param[in] pData     Pointer to received data
 * @param[in] data_len Length of received data in bytes
 * @param[in] arg      Argument we passed to the device open function
 * @return
 *   true:  We have processed the received data
 *   false: We expect more data
 */
static bool handle_rx(const uint8_t *pData, size_t data_len, void *arg)
{
    ESP_LOG_BUFFER_HEXDUMP("handle_rx", pData, data_len, ESP_LOG_INFO);

    if (pData[data_len-1] == 0xFD)
    {
        //ESP_LOG_BUFFER_HEXDUMP("handle_rx-1", pData, data_len, ESP_LOG_INFO);
        
        #ifdef PC_PASSTHROUGH
            /* bridge Radio --> PC */
            tinyusb_cdcacm_write_queue(msg.itf, pData, data_len);
            esp_err_t err = tinyusb_cdcacm_write_flush(msg.itf, 0);
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "CDC ACM write flush error: %s", esp_err_to_name(err));
            }
        #endif
        processCatMessages(pData, data_len);
    }
    return true;
}

/**
 * @brief Device event callback
 *
 * Apart from handling device disconnection it doesn't do anything useful
 *
 * @param[in] event    Device event type and data
 * @param[in] user_ctx Argument we passed to the device open function
 */
static void handle_event(const cdc_acm_host_dev_event_data_t *event, void *user_ctx)
{
    switch (event->type) {
    case CDC_ACM_HOST_ERROR:
        ESP_LOGE(TAG, "CDC-ACM error has occurred, err_no = %i", event->data.error);
        break;
    case CDC_ACM_HOST_DEVICE_DISCONNECTED:
        ESP_LOGI(TAG, "Device suddenly disconnected");
        ESP_ERROR_CHECK(cdc_acm_host_close(event->data.cdc_hdl));
        xSemaphoreGive(device_disconnected_sem);
        break;
    case CDC_ACM_HOST_SERIAL_STATE:
        ESP_LOGI(TAG, "Serial state notif 0x%04X", event->data.serial_state.val);
        break;
    case CDC_ACM_HOST_NETWORK_CONNECTION:
    default:
        ESP_LOGW(TAG, "Unsupported CDC event: %i", event->type);
        break;
    }
}

/**
 * @brief USB Host library handling task
 *
 * @param arg Unused
 */
static void usb_lib_task(void *arg)
{
    while (1) {
        // Start handling system events
        uint32_t event_flags;
        usb_host_lib_handle_events(portMAX_DELAY, &event_flags);
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_NO_CLIENTS) {
            ESP_ERROR_CHECK(usb_host_device_free_all());
        }
        if (event_flags & USB_HOST_LIB_EVENT_FLAGS_ALL_FREE) {
            ESP_LOGI(TAG, "USB: All devices freed");
            // Continue handling USB events to allow device reconnection
        }
        vTaskDelay(pdMS_TO_TICKS(10));
    }
}

/**
 * @brief USB Host Radio TX message send and idle loop task
 *
 * @param arg Unused
 */
static void usb_loop_task(void *arg)
{
    while (1) {  
        if (get_ext_mode_flag) {
            ESP_LOGI(TAG, "***Get extended mode info from radio");
            sendCatRequest(CIV_C_F26A, 0, 0);  // Get extended info -  mode, filter, and datamode status
            get_ext_mode_flag = false;
        }
        vTaskDelay(pdMS_TO_TICKS(10));
       
        #ifndef USE_LEDS
            refresh_display();
        #endif 

        vTaskDelay(pdMS_TO_TICKS(10));

        // Read ADC1 Ch7 (pin 8) for LED brightness POT position.
        ESP_ERROR_CHECK(adc_oneshot_read(adc2_handle, ADC2_CHAN0, &adc_raw[0][0]));
        ESP_LOGI(TAG, "ADC%d Channel[%d] Raw Data: %d", ADC_UNIT_2 + 1, ADC2_CHAN0, adc_raw[0][0]);
        if (do_calibration2) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc2_cali_chan0_handle, adc_raw[0][0], &voltage[0][0]));
            ESP_LOGI(TAG, "ADC%d Channel[%d] Cali Voltage: %d mV", ADC_UNIT_2 + 1, ADC2_CHAN0, voltage[0][0]);
        }
        // invert the ADC because the pot power and ground leads are reversed due board edge ground trace being nearby. Can change in PCB
        led_bright_level= (4096 - adc_raw[0][0]) ;  // 12 bits ADC output range is 4096.  Keep < 4096.
        
        if (led_bright_level > 4094)
            led_bright_level = 4094;  // API will crash if exceed max resolution
        
        if (init_done) {
            led_brightness();  // we now have a valid band so the leds get set correctly
            ESP_LOGI(TAG, "Updated LED band brightness level to %lu", led_bright_level);
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/*---------------------------------------------------------------
        ADC Calibration
---------------------------------------------------------------*/
static bool adc_calibration_init(adc_unit_t unit, adc_channel_t channel, adc_atten_t atten, adc_cali_handle_t *out_handle)
{
    adc_cali_handle_t handle = NULL;
    esp_err_t ret = ESP_FAIL;
    bool calibrated = false;

    #if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
        if (!calibrated) {
            ESP_LOGI(TAG, "calibration scheme version is %s", "Curve Fitting");
            adc_cali_curve_fitting_config_t cali_config = {
                .unit_id = unit,
                .chan = channel,
                .atten = atten,
                .bitwidth = ADC_BITWIDTH_DEFAULT,
            };
            ret = adc_cali_create_scheme_curve_fitting(&cali_config, &handle);
            if (ret == ESP_OK) {
                calibrated = true;
            }
        }
    #endif

    #if ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
        if (!calibrated) {
            ESP_LOGI(TAG, "calibration scheme version is %s", "Line Fitting");
            adc_cali_line_fitting_config_t cali_config = {
                .unit_id = unit,
                .atten = atten,
                .bitwidth = ADC_BITWIDTH_DEFAULT,
            };
            ret = adc_cali_create_scheme_line_fitting(&cali_config, &handle);
            if (ret == ESP_OK) {
                calibrated = true;
            }
        }
    #endif

    *out_handle = handle;
    if (ret == ESP_OK) {
        ESP_LOGI(TAG, "Calibration Success");
    } else if (ret == ESP_ERR_NOT_SUPPORTED || !calibrated) {
        ESP_LOGW(TAG, "eFuse not burnt, skip software calibration");
    } else {
        ESP_LOGE(TAG, "Invalid arg or no memory");
    }

