K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
    return calibrated;
}

static void adc_calibration_deinit(adc_cali_handle_t handle)
{
    #if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
        ESP_LOGI(TAG, "deregister %s calibration scheme", "Curve Fitting");
        ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(handle));

    #elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
        ESP_LOGI(TAG, "deregister %s calibration scheme", "Line Fitting");
        ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(handle));
    #endif
}

void printBinaryWithPadding(uint8_t num, char bin_num[9]) { 
    for (int i = sizeof(uint8_t) * 8 - 1; i >= 0; i--) {
        char b = ((num >> i) & 1) + 0x30;
        //printf("%c", b);
        bin_num[7-i] = b;
        //if (i % 4 == 0) printf(" "); // Group by 4 bits for readability
    }
    bin_num[8] = '\0';
    //ESP_LOGI(TAG,"binary is %s", bin_num);
}

// ----------------------------------------
//      Send CAT Request
// ----------------------------------------
void sendCatRequest(const uint8_t cmd_num, const uint8_t Data[], const uint8_t Data_len)  // first byte in Data is length
{
    int8_t msg_len;
    uint8_t req[50] = { START_BYTE, START_BYTE, radio_address, CONTROLLER_ADDRESS };

    ESP_LOGI("sendCatRequest", "USBH_connected = %d", USBH_connected);

    for (msg_len = 0; msg_len <= cmd_List[cmd_num].cmdData[0]; msg_len++)  // copy in 1 or more command bytes
        req[msg_len + 4] = cmd_List[cmd_num].cmdData[msg_len + 1];

    msg_len += 3;  // Tee up to add data if any

    uint8_t j = 0;
    if (Data_len != 0) {              // copy in 1 or more data bytes, if any
        for (j = 0; j < Data_len; j++)  //pick up with value i
        req[msg_len++] = Data[j];
    }

    req[msg_len] = STOP_BYTE;
    req[msg_len + 1] = 0;  // null terminate for printing or conversion to String type

    #ifdef RAW_TX
        for (uint8_t k = 0; k <= msg_len; k++) {
            ESP_LOGI("sendCatRequest --> Tx Raw Msg: ", "%X,", req[k]);
        }
        ESP_LOGI("sendCatRequest", " msg_len = %d   END", msg_len);
    #endif

    if (USBH_connected) {
        if (msg_len < sizeof(req) - 1) {  // ensure our data is not longer than our buffer
            //ESP_LOGI("sendCatRequest", "***Send CI-V Msg: ");
            int loop_ct = 0;
            while (sending && loop_ct < 5) {   // In case an overlapping send from IRQ call coes in, wait here until the first one is done.
                vTaskDelay(pdMS_TO_TICKS(10));    
                loop_ct++;
            }
            loop_ct = 0;
            sending = 1;
            ESP_LOGI("Send_CatRequest", "*** Send Cat Request Msg - result = %d  END TX MSG, msg_len = %d", cdc_acm_host_data_tx_blocking(cdc_dev, (const uint8_t *)req, msg_len+1, 1000), msg_len);
            vTaskDelay(pdMS_TO_TICKS(10));
            sending = 0;
        } 
        else 
        {
            ESP_LOGI("sendCatRequest", "Buffer overflow");
        }  // if overflow
    }    // if connected
}

// ----------------------------------------
//      Print the received frequency
//
//  This function is only called when the radio's reports a new frequency so is always the radio's real
//    frequency, which when in Xvtr mode, the CI-V message value is the IF frequency.
//
//  The value 'frequency' is a global and is the final displayed frequency, Xvtr band or not.
//    - On entry to this function, frequency is the global displayed value, may not be the actual radio (IF) frequency
//      which is yet to be extracted from the CI-V messaage.
//    - On exit from this function, frequency is either updated (non-XVtr bands) or Xvtr_offset applied, if any.
//
// ----------------------------------------
void read_Frequency(uint64_t freq, uint8_t data_len) {  // This is the displayed frequency, before the radio input, which may have offset applied
    if (frequency > 0) {                   // store frequency per band before it maybe changes bands.  Required to change IF and restore direct after use as an IF.
        //ESP_LOGI(TAG,"read_Frequency: Last Freq %-13llu", frequency);
        if (!update_radio_settings_flag) {   // wait until any XVTR transition complete
        bands[band].VFO_last = frequency;  // store Xvtr or non-Xvtr band displayed frequency per band before it changes.
        prev_band = band;                  // store associated band index
        }
    }  // if an Xvtr band, subtract the offset to get radio (IF) frequency

    // Could do more validation here. Freq Calculation moved to CIV.cpp
    frequency = freq;
    
    band = getBand(frequency);
    if (band != prev_band) {
        //ESP_LOGI("read_Frequency", "***Get extended mode data from radio after band change - Setting flag");
        //get_ext_mode_flag = true;
        
        #ifdef USE_LEDS
            // Turn off LED for previous band
            ESP_ERROR_CHECK(ledc_set_duty(LEDC_MODE, (ledc_channel_t) prev_band, LEDC_OFF_DUTY));
            // Update duty to apply the new value
            ESP_ERROR_CHECK(ledc_update_duty(LEDC_MODE, (ledc_channel_t) prev_band));

            // light up LED for new band
            ESP_ERROR_CHECK(ledc_set_duty(LEDC_MODE, (ledc_channel_t) band, led_bright_level));
            // Update duty to apply the new value
            ESP_ERROR_CHECK(ledc_update_duty(LEDC_MODE, (ledc_channel_t) band));
        #else
            draw_new_screen();
        #endif

        prev_band = band;
    }

    // Use the band to operate our band enable outputs for the 6 905 bands.
    Band_Decode_Output(band);

    //ESP_LOGI(TAG,"read_Frequency: Freq %-13llu  band =  %d  Xvtr_Offset = %llu  datalen = %d   btConnected %d   USBH_connected %d   BT_enabled %d   BLE_connected %d  radio_address %X", frequency, band, bands[XVTR_Band].Xvtr_offset, data_len, btConnected, USBH_connected, BT_enabled, BLE_connected, radio_address);
    // On exit from this function we have a new displayed frequency that has XVTR_Offset added, if any.
}

// ----------------------------------------
//    get band from frequency
// ----------------------------------------
uint8_t getBand(uint64_t _freq) {
  for (uint8_t i = 0; i < NUM_OF_BANDS; i++) {
    if (_freq >= bands[i].edge_lower && _freq <= bands[i].edge_upper) {
      if (i >= NUM_OF_BANDS-1) return NUM_OF_BANDS-1;
      return i;
    }
  }
  return 0x00;  // no band for considered frequency found
}

// Send new frequency to radio, radio will change bands as needed.
// ToDo:  Radio mode and other settings are not touched so stay the same as the last band used.  We are only changing the frequency, nothing else.
//        Need to save mode, filter and other stuff to return each band to the last way it was used.
void SetFreq(uint64_t Freq) {
  uint8_t vfo_dec[7] = {};
  uint8_t len = formatFreq(Freq, vfo_dec);  // Convert to BCD string
  ESP_LOGI("SetFreq","Set Radio Freq to %llu  Bytes sent to radio (5 or 6 bytes) in BCD: %02X %02X %02X %02X %02X (%02X)", Freq, vfo_dec[0], vfo_dec[1], vfo_dec[2], vfo_dec[3], vfo_dec[4], vfo_dec[5]);
  sendCatRequest(CIV_C_F1_SEND, vfo_dec, len);
}

// Length is 5 or 6 depending if < 10GHz band  followed by 5 or 6 BCD encoded frequency bytes
// vfo_dec[] holds the frequency result to send out
// returns length;
uint8_t formatFreq(uint64_t vfo, uint8_t vfo_dec[]) {
  //static uint8_t vfo_dec[7] = {};  // hold 6 or 7 bytes (length + 5 or 6 for frequency, bcd encoded bytes)
  uint8_t len;

  if (vfo < 10000000000LL) {
    len = 5;
    vfo_dec[6] = (uint8_t)0x00;  // set to 0, unused < 10Ghz
    for (uint8_t i = 0; i < len; i++) {
      uint64_t x = vfo % 100;
      vfo_dec[i] = bcdByteEncode((uint8_t)(x));
      vfo = vfo / 100;
    }
    //ESP_LOGI(TAG," VFO: < 10G Bands = Reversed hex to DEC byte %02X %02X %02X %02X %02X %02X", vfo_dec[0], vfo_dec[1], vfo_dec[2], vfo_dec[3], vfo_dec[4], vfo_dec[5]);
  } else {
    len = 6;
    for (uint8_t i = 0; i < len; i++) {
      uint64_t x = vfo % 100;
      vfo_dec[i] = bcdByteEncode((uint8_t)(x));
      vfo = vfo / 100;
    }
    //ESP_LOGI(TAG," VFO: > 10G Bands = Reversed hex to DEC byte %02X %02X %02Xpass_PC_to_radio %02X %02X %02X %02X", vfo_dec[0], vfo_dec[1], vfo_dec[2], vfo_dec[3], vfo_dec[4], vfo_dec[5], vfo_dec[6]);
  }
  return len;  // 5 or 6
}

uint8_t IC_905_Input_scan(void) 
{
    uint8_t pattern = 0;
        pattern |= GPIO_PTT_INPUT;       // PTT input from Radio SEND jack  Gnd - TX
    return pattern & 0x01;  // single GPIO pins spare for now
}

// convert band number to a unique band output pattern
void Band_Decode_Output(uint8_t band) // pass IF_Switch_OFF value to GPIO_out for sequencing usage
{
    ESP_LOGI("  Band_Decode_Output", "band %s", bands[band].band_name);
    switch (band)  // Now set them to the desired ON state
    {   
        case  BAND_2M   : GPIO_Out(DECODE_BAND144);  break;   //2M
        case  BAND_70cm : GPIO_Out(DECODE_BAND430);  break;   //432
        case  BAND_23cm : GPIO_Out(DECODE_BAND1200); break;   //1296
        case  BAND_13cm : GPIO_Out(DECODE_BAND2300); break;   //2400
        case  BAND_6cm  : GPIO_Out(DECODE_BAND5600); break;   //5760M
        case  BAND_3cm  : GPIO_Out(DECODE_BAND10G);  break;   //10.368.1G
    }
}

void GPIO_Out(uint8_t pattern)
{
    char bin_num[9] ={};
    printBinaryWithPadding(pattern, bin_num);
    ESP_LOGI("  Band_Decode_Output", "pattern:  DEC=%d    HEX=%X   Binary=%s", pattern, pattern, bin_num);
    // write to the assigned pin for each band enable output port
    gpio_set_level(GPIO_BAND_OUTPUT_144,  (pattern & 0x01) ? 1 : 0);  // bit 0
    gpio_set_level(GPIO_BAND_OUTPUT_430,  (pattern & 0x02) ? 1 : 0);  // bit 1
    gpio_set_level(GPIO_BAND_OUTPUT_1200, (pattern & 0x04) ? 1 : 0);  // bit 2
    gpio_set_level(GPIO_BAND_OUTPUT_2300, (pattern & 0x08) ? 1 : 0);  // bit 3
    gpio_set_level(GPIO_BAND_OUTPUT_5600, (pattern & 0x10) ? 1 : 0);  // bit 4
    gpio_set_level(GPIO_BAND_OUTPUT_10G,  (pattern & 0x20) ? 1 : 0);  // bit 5
}

