K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
void PTT_Output(uint8_t band, bool PTT_state)
{
    ESP_LOGI("PTT_Output:", " Band %s   PTT_state %d", bands[band].band_name, PTT_state);
    switch (band)
    {
        case  DUMMY     : GPIO_PTT_Out(DECODE_DUMMY_PTT,    false);     break;   //Dummy Band
        case  BAND_2M   : GPIO_PTT_Out(DECODE_BAND144_PTT,  PTT_state); break;   //2M
        case  BAND_70cm : GPIO_PTT_Out(DECODE_BAND430_PTT,  PTT_state); break;   //432
        case  BAND_23cm : GPIO_PTT_Out(DECODE_BAND1200_PTT, PTT_state); break;   //1296
        case  BAND_13cm : GPIO_PTT_Out(DECODE_BAND2300_PTT, PTT_state); break;   //2400
        case  BAND_6cm  : GPIO_PTT_Out(DECODE_BAND5600_PTT, PTT_state); break;   //5760M
        case  BAND_3cm  : GPIO_PTT_Out(DECODE_BAND10G_PTT,  PTT_state); break;   //10.368.1G
    }
}

void GPIO_PTT_Out(uint8_t pattern, bool _PTT_state)
{   
    uint8_t PTT_state = _PTT_state ? 0xFF : 0;

    char bin_num[9] ={};
    printBinaryWithPadding(pattern, bin_num);
    ESP_LOGI("GPIO_PTT_Out", "PTT Output Binary %s   PTT Output Hex 0x%02X   PTT Level at CPU pin %d", bin_num, pattern, _PTT_state);
    gpio_set_level(GPIO_PTT_OUTPUT_144,  (pattern & 0x01 & PTT_state) ? 1 : 0);  // bit 0 144
    gpio_set_level(GPIO_PTT_OUTPUT_430,  (pattern & 0x02 & PTT_state) ? 1 : 0);  // bit 1 430
    gpio_set_level(GPIO_PTT_OUTPUT_1200, (pattern & 0x04 & PTT_state) ? 1 : 0);  // bit 2 1200
    gpio_set_level(GPIO_PTT_OUTPUT_2300, (pattern & 0x08 & PTT_state) ? 1 : 0);  // bit 3 2300
    gpio_set_level(GPIO_PTT_OUTPUT_5600, (pattern & 0x10 & PTT_state) ? 1 : 0);  // bit 4 5600
    gpio_set_level(GPIO_PTT_OUTPUT_10G,  (pattern & 0x20 & PTT_state) ? 1 : 0);  // bit 5 10G
}

// --------------------------------------------------
//   Process the received messages from transceiver
// --------------------------------------------------
void processCatMessages(const uint8_t read_buffer[], size_t data_len) {
    /*
        <FE FE E0 42 04 00 01 FD  - LSB
        <FE FE E0 42 03 00 00 58 45 01 FD  -145.580.000

        FE FE - start bytes
        00/E0 - target address (broadcast/controller)
        42 - source address
        00/03 - data type
        <data>
        FD - stop byte
    */

    uint8_t cmd_num;
    uint8_t match = 0;
    uint8_t data_start_idx = 0;

    if (1) {
        //bool knowncommand = true;
        int i;
        uint8_t msg_len = 0;

        cmd_num = 255;
            match = 0;

        if ((msg_len = data_len) > 0) {
            //#define SEE_RAW_RX
            #ifdef SEE_RAW_RX
                ESP_LOGI("processCatMessages", "<++ Rx Raw Msg: ");
                for (uint8_t k = 0; k < msg_len; k++) {
                    ESP_LOG_BUFFER_HEXDUMP("processCatMessages", &read_buffer[k], 1, ESP_LOG_INFO);
                    //ESP_LOGI("processCatMessages", ",");
                }
                ESP_LOGI("processCatMessages", " msg_len = %d END", msg_len);
            #endif
            if (read_buffer[0] == START_BYTE && read_buffer[1] == START_BYTE) {
                radio_address_received = read_buffer[3];
                if (read_buffer[3] == radio_address) {
                    if (read_buffer[2] == CONTROLLER_ADDRESS || read_buffer[2] == BROADCAST_ADDRESS) {

                        for (cmd_num = CIV_C_F_SEND; cmd_num < End_of_Cmd_List; cmd_num++)  // loop through the command list structure looking for a pattern match
                        {
                            //ESP_LOGI("processCatMessages", "processCatMessageslist: list index = "); DPRINTLN(cmd_num);
                            for (i = 1; i <= cmd_List[cmd_num].cmdData[0]; i++)  // start at the highest and search down. Break out if no match. Make it to the bottom and you have a match
                            {
                                //ESP_LOGI("processCatMessages", "processCatMessages: byte index = "); DPRINTLN(i);
                                //ESP_LOGI(TAG,"processCatMessages: cmd_num=%d from radio, current byte from radio = %X  next byte=%X, on remote length=%d and cmd=%X",cmd_num, read_buffer[3+i], read_buffer[3+i+1], cmd_List[cmd_num].cmdData[0], cmd_List[cmd_num].cmdData[1]);
                                if (cmd_List[cmd_num].cmdData[i] != read_buffer[3 + i]) {
                                //ESP_LOGI("processCatMessages", "processCatMessages: Skip this one - Matched 1 element: look at next field, if any left. CMD Body Length = ");
                                //ESP_LOGI("processCatMessages", cmd_List[cmd_num].cmdData[0]); DPRINTF(" CMD  = "); ESP_LOGI(TAG,(cmd_List[cmd_num].cmdData[i], HEX);DPRINTF(" next RX byte = "); DPRINTLN(read_buffer[3+i+1],HEX);
                                match = 0;
                                break;
                                }
                                match++;
                                //ESP_LOGI("processCatMessages", "processCatMessages: Possible Match: Len = "); ESP_LOGI(TAG,(cmd_List[cmd_num].cmdData[0],DEC); DPRINTF("  CMD1 = "); ESP_LOGI(TAG,(read_buffer[4],HEX);
                                //ESP_LOGI("processCatMessages", " CMD2  = "); ESP_LOGI(TAG,(read_buffer[5],HEX); DPRINTF(" Data1/Term  = "); DPRINTLN(read_buffer[6],HEX);
                            }

                            //if (read_buffer[3+i] == STOP_BYTE)  // if the next byte is not a stop byte then it is thge next cmd byte or maybe a data byte, depends on cmd length

                            if (match && (match == cmd_List[cmd_num].cmdData[0])) 
                            {
                                //ESP_LOGI("processCatMessages", "processCatMessages:    FOUND MATCH: Len = "); ESP_LOGI(TAG,(cmd_List[cmd_num].cmdData[0],DEC); DPRINTF("  CMD1 = "); ESP_LOGI(TAG,(read_buffer[4],HEX);
                                //ESP_LOGI("processCatMessages", " CMD2  = "); ESP_LOGI(TAG,(read_buffer[5],HEX);  DPRINTF(" Data1/Term  = "); ESP_LOGI(TAG,(read_buffer[6],HEX); DPRINTF("  Message Length = "); DPRINTLN(msg_len);
                                break;
                            }
                        }

                        data_start_idx = 4 + cmd_List[cmd_num].cmdData[0];
                        data_len = msg_len - data_start_idx - 1;

