K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
                        //uint8_t k;
                        //for (k = 0; k < msg_len; k++)
                        //    CIV_data[k] = read_buffer[data_start_idx + k];

                        ESP_LOGI("processCatMessages", "cmd = %X  data_start_idx = %d  data_len = %d", cmd_List[cmd_num].cmdData[1], data_start_idx, data_len);

                        if (cmd_num >= End_of_Cmd_List - 1) 
                        {
                            ESP_LOGI("processCatMessages", "processCatMessages: No message match found - cmd_num = %d  read_buffer[4 & 5] = %X %X", cmd_num, read_buffer[4], read_buffer[5]);
                            //knowncommand = false;
                        } 
                        else 
                        {
                            ESP_LOGI("processCatMessages", "Call CIV_Action");
                            CIV_Action(cmd_num, data_start_idx, data_len, msg_len, read_buffer);
                        }
                    }  // is controller address
                }    // is radio address
            }      // is preamble
        }        // readline
    }          // while
}

//
//    formatVFO()
//
char *formatVFO(uint64_t vfo) {
  static char vfo_str[20] = { "" };
  //if (ModeOffset < -1 || ModeOffset > 1)
  //vfo += ModeOffset;  // Account for pitch offset when in CW mode, not others

  uint32_t MHz = (vfo / 1000000 % 1000000);
  uint16_t Hz = (vfo % 1000) / 10;
  uint16_t KHz = ((vfo % 1000000) - Hz) / 1000;
  if (board_type == M5ATOMS3) {
    sprintf(vfo_str, "%lu.%03u.%01u", MHz, KHz, Hz/10);
  } else {
    sprintf(vfo_str, "%lu.%03u.%02u", MHz, KHz, Hz);
  }
  ///sprintf(vfo_str, "%-13s", "012345.123.123");  // 999GHZ max  47G = 47000.000.000
  ///DPRINT("New VFO: ");DPRINTLN(vfo_str);
  return vfo_str;
}

void draw_new_screen(void) {
    int16_t x = 46;  // start position
    int16_t y = 16;
    int16_t w = 319;  // end of a line
    int16_t y1 = y + 13;
    //int16_t h = 20;
    int16_t font_sz = 4;  // font size
    //ESP_LOGI(TAG,"+++++++++draw new screen");

    #ifdef  ATOMS3
        font_sz = 3;  // downsize for Atom
        x = 46;  // start position
        y = 6;
        w = 127;  // end of a line
        y1 = 14;   // height of line
        //h = 12;

        int16_t color = TFT_YELLOW;
        M5.Lcd.fillScreen(TFT_BLACK);
        M5.Lcd.setTextColor(TFT_YELLOW, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
        M5.Lcd.setTextDatum(MC_DATUM);
        //M5.Lcd.drawString("CI-V band Decoder", (int)(M5.Lcd.width() / 2), y, font_sz);
        M5.Lcd.drawString(title, (int)(M5.Lcd.width() / 2), y, font_sz);
        M5.Lcd.drawFastHLine(1, y1, w, TFT_RED);  // separator below title
        M5.Lcd.setTextDatum(MC_DATUM);
        M5.Lcd.setTextColor(TFT_CYAN, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
    #endif
    
    // write the Band and PTT icons
    display_Freq(frequency, true);
    display_PTT(PTT, true);
    display_Band(band, true);  // true means draw the icon regardless of state
    display_Time(UTC, true);
    display_Grid(Grid_Square, true);
}

//  _UTC does nothing now but can be used to change a future clock label
void display_Time(uint8_t _UTC, bool _force) {
    #ifdef POLL_FOR_TIME
        static uint64_t time_last_disp_UTC = esp_timer_get_time();
        
        if ((esp_timer_get_time() >= time_last_disp_UTC + POLL_RADIO_UTC*1000) || _force) {
            if (USBH_connected) // wait until we are fully running
                poll_for_time();
            int x = 10;
            int x1 = 310;
            int y = 52;
            int font_sz = 4;

            #if !defined (M5STAMPC3U) && defined (ATOMS3)
                if (board_type == M5ATOMS3) {
                    font_sz = 3;  // downsize for Atom
                    x = 1;
                    x1 = 127;
                    y = 25;
                    font_sz = 3;
                }
                
                char temp_t[64] = {};
                //char *myDate = ctime(&t);   for testing
                //ESP_LOGI(TAG, "myDate: %s now %lld", myDate, t);

                struct tm local = *localtime(&t);
                ESP_LOGI(TAG, "Time is now : %02d/%02d/%02d    %02d:%02d:%02d", (local.tm_mon)+1, local.tm_mday, \
                    (local.tm_year+1900), local.tm_hour, local.tm_min, local.tm_sec);

                localtime_r(&t, &tm);
                
                //sprintf(temp_t,"%d-%02d-%02d, %02d:%02d:%02d",(tm.tm_year)+1900,(  tm.tm_mon)+1, tm.tm_mday, tm.tm_hour, tm.tm_min, tm.tm_sec );
                //ESP_LOGI("display_Time", "%s", temp_t);      
                if ((tm.tm_year+1900) != 1970) {   // skip if date not updated yet which shows 1970
                    M5.Lcd.setTextColor(TFT_LIGHTGREY, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
                    M5.Lcd.setTextDatum(ML_DATUM);  // x is left side
                    sprintf(temp_t, "%02d/%02d/20%02d", (tm.tm_mon)+1, tm.tm_mday, (tm.tm_year)+1900);
                    M5.Lcd.drawString(temp_t, x, y, font_sz);
                    ESP_LOGI("display_Time","Date is now %s", temp_t);
                    M5.Lcd.setTextDatum(MR_DATUM);  // x1 is right side
                    sprintf(temp_t, "%02d:%02d:%02d", tm.tm_hour, tm.tm_min, tm.tm_sec);
                    M5.Lcd.drawString(temp_t, x1, y, font_sz);
                    ESP_LOGI("display_Time","Time is now %s", temp_t);
                }
            #endif

            time_last_disp_UTC = esp_timer_get_time();
        }
    #endif
}

void display_PTT(bool _PTT_state, bool _force) {
    static bool _prev_PTT_state = true;
    char PTT_Tx[3] = "TX";
    int x = 310;
    int y = 150;
    int x1 = x - 33;  // upper left corner of outline box
    int y1 = y - 18;
    int font_sz = 4;  // font size
    int w = 38;       // box width
    int h = 30;       // box height
    int r = 4;        // box radius corner size

    #if !defined (M5STAMPC3U) &&  defined (ATOMS3)
        M5.Lcd.setTextDatum(MR_DATUM);
        if (board_type == M5ATOMS3) {
        font_sz = 3;  // downsize for Atom
        x = 124;
        y = 118;
        x1 = x-16;
        y1 = y-8; 
        w = 20;
        h = 14;
        r = 4;
        }
        
        if (_PTT_state != _prev_PTT_state || _force) {
        #ifdef PRINT_PTT_TO_SERIAL
            ESP_LOGI(TAG, "*********************************************** PTT = %d", _PTT_state);
        #endif
        if (_PTT_state) {
            M5.Lcd.fillRoundRect(x1, y1, w, h, r, TFT_RED);
            M5.Lcd.setTextColor(TFT_WHITE);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
            M5.Lcd.drawString(PTT_Tx, x, y, font_sz);
        } else {
            M5.Lcd.fillRoundRect(x1, y1, w, h, r, background_color);
            M5.Lcd.setTextColor(TFT_RED);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
            M5.Lcd.drawString(PTT_Tx, x, y, font_sz);
        }
        M5.Lcd.drawRoundRect(x1, y1, w, h, r, TFT_RED);
        _prev_PTT_state = _PTT_state;
        }
    #endif
}

void display_Freq(uint64_t _freq, bool _force) {
  static uint64_t _prev_freq;
  int16_t x = 1;  // start position
  int16_t y = 104;
  int16_t font_sz = 6;  // font size

  if ((_freq != _prev_freq && _freq != 0) || _force) {
    #ifdef PRINT_VFO_TO_SERIAL
      ESP_LOGI(TAG,"VFOA: %13sMHz - Band: %s  Mode: %s  DataMode: %s  Filter: %s  Source: BLE %d, USBHost %d, BTClassic %d", formatVFO(_freq), bands[band].band_name, \
          modeList[bands[band].mode_idx].mode_label, ModeStr[bands[band].datamode], FilStr[bands[band].filt], BLE_connected, USBH_connected, btConnected);
    #endif
    if (board_type == M5ATOMS3) {
      font_sz = 4;  // downsize for Atom
      y = 54;
    }

    #if !defined (M5STAMPC3U) &&  defined (ATOMS3)
      int16_t color = TFT_WHITE;
      //M5.Lcd.fillRect(x, y, x1, y1, background_color);
      M5.Lcd.setTextDatum(MC_DATUM);
      M5.Lcd.setTextColor(background_color, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
      M5.Lcd.setTextColor(background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
      M5.Lcd.drawString(formatVFO(_prev_freq), (int)(M5.Lcd.width() / 2), y, font_sz);
      //M5.Lcd.setTextColor(color, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
      M5.Lcd.setTextColor(color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
      M5.Lcd.drawString(formatVFO(_freq), (int)(M5.Lcd.width() / 2), y, font_sz);
    #endif // M5STAMPC3U
    _prev_freq = _freq;
  }
}

void display_Band(uint8_t _band, bool _force) {
  static uint8_t _prev_band = 255;
  int x = 8;
  int y = 150;
  int font_sz = 4;


  if (_band != _prev_band || _force) {
    // Update our outputs
    //Band_Decode_Output(band, false);
    //sendBand(band);   // change the IO pins to match band
    //ESP_LOGI(TAG,"Band %s", bands[_band].band_name);

    #if !defined (M5STAMPC3U) &&  defined (ATOMS3)
      if (board_type == M5ATOMS3) {
        font_sz = 4;  // downsize for Atom
        x = 1;
        y= 118;
      }
      M5.Lcd.setTextDatum(ML_DATUM);
      M5.Lcd.setTextDatum(ML_DATUM);
      M5.Lcd.setTextColor(background_color, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
      M5.Lcd.drawString(bands[_prev_band].band_name, x, y, font_sz);
      M5.Lcd.setTextColor(TFT_CYAN);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
      M5.Lcd.drawString(bands[_band].band_name, x, y, font_sz);
    #endif

