K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
    if (frequency != 0) {
      if (!update_radio_settings_flag)
        #ifdef SD_CARD
          write_bands_data();  // save on band changes.  Other times would be good bu this catches the most.
        #else
        ; // nothing
        #endif
      else                   // by this time we should be stable after XVTR transitions
        update_radio_settings_flag = false;
    }
    _prev_band = _band;
  }
}

void display_Grid(char _grid[], bool _force) {
  static char _last_grid[9] = {};
  int x = 8;
  int y = 184;
  int font_sz = 4;
  // call to convert the strings for Lat and long fronm CIV to floats and then caluclate grid
  if ((strcmp(_last_grid, _grid)) || _force) {
    //ESP_LOGI(TAG,"Grid Square = %s",_grid);

    #if !defined (M5STAMPC3U) &&  defined (ATOMS3)
      if (board_type == M5ATOMS3) {
        font_sz = 4;  // downsize for Atom
        y = 86;
        M5.Lcd.setTextDatum(MC_DATUM);
        M5.Lcd.setTextColor(background_color, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
        M5.Lcd.drawString(_last_grid, (int)(M5.Lcd.width() / 2), y, font_sz);
        M5.Lcd.setTextColor(TFT_DARKGREEN, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
        M5.Lcd.drawString(_grid, (int)(M5.Lcd.width() / 2), y, font_sz);
      } else {
        M5.Lcd.setTextDatum(ML_DATUM);
        M5.Lcd.setTextColor(background_color, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
        M5.Lcd.drawString(_last_grid, x, y, font_sz);
        M5.Lcd.setTextColor(TFT_GREEN, background_color);  //Set the color of the text from 0 to 65535, and the background color behind it 0 to 65535
        M5.Lcd.drawString(_grid, x, y, font_sz);
      }
    #endif   
    strcpy(_last_grid, _grid);
  }
}

void poll_for_time(void){
    if (init_done && !sending) { // && board_type == M5ATOMS3) {
        /*   Do not need to get UTC offset since it is called at startup and is a global.
        if (radio_address == IC905)                  //905
            sendCatRequest(CIV_C_UTC_READ_905, 0, 0);  //CMD_READ_FREQ);
        else if (radio_address == IC705)             // 705
            sendCatRequest(CIV_C_UTC_READ_705, 0, 0);  //CMD_READ_FREQ);
        vTaskDelay(pdMS_TO_TICKS(2));
        */
        ESP_LOGI(TAG, "***Get Time from radio");
        sendCatRequest(CIV_C_MY_POSIT_READ, 0, 0); 
        vTaskDelay(pdMS_TO_TICKS(2));
    }
}

void refresh_display(void) {
    display_Freq(frequency, false);
    #ifndef USE_LEDS
        display_Time(UTC, false);
        display_PTT(PTT, false);
        display_Band(band, false);  // true means draw the icon regardless of state
        display_Grid(Grid_Square, false);
    #endif  // If we have LEDs then we likey have no screen to draw.
}

uint8_t Get_Radio_address(void) {
    uint8_t retry_Count = 0;
    
    if (USBH_connected)
    {
        while (radio_address == 0x00 || radio_address == 0xFF || radio_address == 0xE0) {
            if (radio_address_received == 0) {
                ESP_LOGI("Get_Radio_address:", "Radio not found - retry count = %X", retry_Count);
                vTaskDelay(100);
                if (retry_Count++ > 4)
                    break;
            } else {
                radio_address = radio_address_received;
                ESP_LOGI("Get_Radio_address: ", "Radio found at %X", radio_address);
            }
        }
    }
    return retry_Count;
}

void setup_IO(void)
{   
    // Set up an interrupt on our PTT input pin and set output pins
    //zero-initialize the config structure.
    gpio_config_t io_conf = {};
    //disable interrupt
    io_conf.intr_type = GPIO_INTR_DISABLE;
    //set as output mode
    io_conf.mode = GPIO_MODE_OUTPUT;
    //bit mask of the pins that you want to set,e.g. GPIO_BAND_OUTPUT_144 and GPIO_PTT_OUTPUT_144
    io_conf.pin_bit_mask = GPIO_OUTPUT_PIN_SEL;
    //disable pull-down mode
    io_conf.pull_down_en = (gpio_pulldown_t) 0;
    //disable pull-up mode
    io_conf.pull_up_en = (gpio_pullup_t) 0;
    //configure GPIO with the given settings
    gpio_config(&io_conf);

    //interrupt of falling edge (may be rising edge after input is buffered, thus inverted)
    //io_conf.intr_type = GPIO_INTR_NEGEDGE;  // or POSEDGE
    io_conf.intr_type = GPIO_INTR_ANYEDGE;
    //bit mask of the pins, use GPIO_PTT_INPUT pin
    io_conf.pin_bit_mask = GPIO_INPUT_PIN_SEL;
    //set as input mode
    io_conf.mode = GPIO_MODE_INPUT;
    //enable pull-up mode
    io_conf.pull_up_en = (gpio_pullup_t) 1;
    gpio_config(&io_conf);

    // De-Glitch PTT
    gpio_glitch_filter_handle_t filter;

    //gpio_flex_glitch_filter_config_t filter_config = {GLITCH_FILTER_CLK_SRC_DEFAULT, GPIO_PTT_INPUT, 5000 , 2000};
    //ESP_ERROR_CHECK(gpio_new_flex_glitch_filter(&filter_config, &filter));
    
    gpio_pin_glitch_filter_config_t filter_config = {GLITCH_FILTER_CLK_SRC_DEFAULT, (gpio_num_t) GPIO_PTT_INPUT};
    ESP_ERROR_CHECK(gpio_new_pin_glitch_filter(&filter_config, &filter));
    
    ESP_ERROR_CHECK(gpio_glitch_filter_enable(filter));

    //change gpio intrrupt type for one pin
    //gpio_set_intr_type(GPIO_PTT_INPUT, GPIO_INTR_ANYEDGE);

    // Set output pins to low.  High turns on the buffers (inverted)
    PTT_Output(0,0);

    //create a queue to handle gpio event from isr
    gpio_evt_queue = xQueueCreate(10, sizeof(uint32_t));
    //start gpio task
    xTaskCreate(gpio_PTT_Input, "gpio_PTT_Input", 8092, NULL, 10, NULL);

    //install gpio isr service
    gpio_install_isr_service(ESP_INTR_FLAG_DEFAULT);
    //hook isr handler for specific gpio pin
    gpio_isr_handler_add((gpio_num_t)GPIO_PTT_INPUT, gpio_isr_handler, (void*) (gpio_num_t) GPIO_PTT_INPUT);

    // Set up ADC for LED brightness dimming
    
    //-------------ADC2 Init---------------//
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config2, &adc2_handle));

    //-------------ADC2 Config---------------//
    adc_oneshot_chan_cfg_t config = {
        .atten = ADC_ATTEN,
        .bitwidth = ADC_BITWIDTH_DEFAULT,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc2_handle, ADC2_CHAN0, &config));
}

/**
 * @brief Main application
 *
 * Here we open a USB CDC device and send some data to it
 */
//int app_main(void)   // for .c files
extern "C" void app_main(void)  // for .cpp files
{
    ESP_LOGI(TAG, "IC-905 USB Band Decoder and PTT Breakout - K7MDL Jan 2025");

    setup_IO();

    #ifdef USE_LEDS
        ledc_init();    
    #else  // USE RGB pin 48 or external LED via GPIO for the red PTT in LED on pin 47
        gpio_reset_pin(GPIO_NUM_47);
        gpio_set_direction(GPIO_NUM_47, GPIO_MODE_OUTPUT_OD);  // using RGB LED as simple PTT LED
        gpio_set_level(GPIO_NUM_47, 1);  // Turn it Off.
    #endif 

