K7MDL2/IC-905_Band_Decoder_on_ESP32-S3/main/IC905_ESP32-S3_PTT_Breakout.cpp
        ESP_ERROR_CHECK(cdc_acm_host_set_control_line_state(cdc_dev, false, false));
        
        USBH_connected = true;

        // We can now send to CI-V
        vTaskDelay(pdMS_TO_TICKS(2));  // Time for radio to to beready for comms after connection
        
        ESP_LOGI(TAG, "***Starting CI-V communications");
        //SetFreq(145500000);  // Used for testing when there is no screen, can see radio respond to something.
        vTaskDelay(pdMS_TO_TICKS(2));
        
        ESP_LOGI(TAG, "***Get frequency from radio");
        sendCatRequest(CIV_C_F_READ, 0, 0);  // Get current VFO     
        vTaskDelay(pdMS_TO_TICKS(20));
        
        ESP_LOGI(TAG, "***Get CI-V address from radio");
        Get_Radio_address();
        vTaskDelay(pdMS_TO_TICKS(2));  // Time for radio to to beready for comms after connection

        // Get started by retrieving frequency, mode, time & location and time offset.
        ESP_LOGI(TAG, "***Get extended mode info from radio");
        sendCatRequest(CIV_C_F26A, 0, 0);  // Get extended info -  mode, filter, and datamode status
        vTaskDelay(pdMS_TO_TICKS(20));
        
        ESP_LOGI(TAG, "***Get UTC Offset from radio");
        if (radio_address == IC905)                  //905
            sendCatRequest(CIV_C_UTC_READ_905, 0, 0);  //CMD_READ_FREQ);
        else if (radio_address == IC705)             // 705
            sendCatRequest(CIV_C_UTC_READ_705, 0, 0);  //CMD_READ_FREQ);
        vTaskDelay(pdMS_TO_TICKS(20));
        
        ESP_LOGI(TAG, "***Get time, date and position from radio.  We will then calculate grid square");
        sendCatRequest(CIV_C_MY_POSIT_READ, 0, 0);  //CMD_READ_FREQ);
        vTaskDelay(pdMS_TO_TICKS(20));

        #ifdef PC_PASSTHROUGH
            esp_log_level_set("*", ESP_LOG_NONE);
        #endif

        init_done = 1;
        ESP_LOGI(TAG, "***Now wait for radio dial and band change messaages");
        // usb_loop_task() is where our program runs within now.  
        // handler_rx takes care of received events
        // Do not Transmit to USB (such as call send_CAT_Request()) from the handler_rx, they will overlap and cause timeouts.
        // Incoming CIV data appears in handler_rx which in turn calls processmessages() and CIV_Action(). 
        // If anything needs to be TX back to the radio by those processes like mode calling get ext mode, 
        // or read frequency() calling get ext mode, set a flag and let usb_loop_task() handle it.
        
        // We are done.  The tasks are running things now. Wait for device disconnection and start over
        
        // program waits here while tasks run handling events
        xSemaphoreTake(device_disconnected_sem, portMAX_DELAY);
    }
}
